**********************************************************;
**** 주성분 분석에 대한 스코어링 코드 시작;
**********************************************************;
LENGTH _FORMAT $200;
LENGTH _NORMFMT $%DMNORLEN;
;
/************************************************/
* 구간 변수에 대한 결측값 처리;
/************************************************/
;
length _D1 8;
if FASHION=. then _D1 = 0;
else _D1=(FASHION-92.2626995645863)/32.6162823909176;
length _D2 8;
if LEISURE=. then _D2 = 0;
else _D2=(LEISURE-1916.41944847605)/350.839963390581;
length _D3 8;
if ORIGINAL=. then _D3 = 0;
else _D3=(ORIGINAL-1849.38461538461)/291.607974629673;
length _D4 8;
if STRETCH=. then _D4 = 0;
else _D4=(STRETCH-444.040638606676)/211.690142352824;
;
DROP _FORMAT _NORMFMT
_D1
_D2
_D3
_D4
;
